{
	"title": "Restaurant Manager, Binchotan Bar & Grille",
	"company": "Accor",
	"location": "United States",
	"description": "Company Description\n\nExplore limitless possibilities, dreams and adventures on Hawai’i Island as you blaze a trail for a rewarding career in hospitality. Embrace our passion for Hawai’i’s heritage, culture and traditions with amazing career opportunities that await you in paradise. Journey into a luxury oasis where the aloha spirit comes alive.\n\nFairmont Orchid is an award-winning luxury resort located on the majestic Kohala Coast of Hawai‘i Island. Immerse yourself in an authentic Hawaiian experience, surrounded by 32 oceanfront acres of lush tropical gardens, cascading waterfalls and a tranquil white sand beach and lagoon. Hawai‘i’s warmth and serenity are reflected throughout the design of our family-friendly hotel accommodations with spacious guest rooms, suites and the exclusive Fairmont Gold concierge floor.\n\nResort amenities include our Spa Without Walls, a 10,000-square-foot oceanfront pool, cultural activities, onsite restaurants, access to world-class golf, a 24/7 fitness center and a 10-court tennis pavilion. Inspired by culture, well-being and genuine aloha, Fairmont Orchid welcomes you to experience authentic Hawai‘i.\n\n**What is in it for you:**\n\n- Premium preferred provider medical/drug/vision benefits at competitive prices.\n- We put you first & value you with employer paid coverage for group life and accidental insurance coverage (1x annual salary) + Coverage is available for your ‘ohana!\\*\n- We believe that hospitality has the power to unlock a better tomorrow with our 401(k)/retirement saving plan & matching program.\n- Don’t just live in the moment – own your moment with 15 paid holiday/personal days per year + 10 days of paid vacation that begin accruing immediately\\*\n- Incentive Bonuses are available to inspire creativity & dedication to deliver exceptional experiences.\n- We go the extra mile by offering 50% discounts at hotel restaurants, 50% discount on retail items at our Fairmont Store & 30% discount of services offered in our Spa Without Walls.\n- We are globetrotters taking advantage of our Travel Program with unlimited employee discounts at Accor properties + Friends & Family rates (5,000+ hotels worldwide)\\*\n- Complimentary food & beverage on property\n\nJob Description\n\nAre You a Born Restaurateur with a Fire for Excellence?\n\nAt Binchotan Bar & Grill, we blend centuries-old Asian culinary traditions with the vibrant flavors of Hawaiʻi, creating an unforgettable dining experience where every dish tells a story. As the Restaurant Manager, you won’t just oversee operations—you’ll curate an atmosphere of warmth, artistry, and impeccable service, ensuring each guest leaves craving more.\n\nIf you live for the rhythm of a bustling restaurant, thrive on elevating team performance, and believe that true hospitality lies in the details, this is your stage.\n\n**Your Role: Where Leadership Meets Culinary Passion:**\n\n- Own the dining room, crafting seamless, memorable experiences from the first greeting to the final farewell.\n- Collaborate with chefs to showcase culinary and service artistry, telling the story of the Binchotan concept: A Journey Through Asia, Ignited in Hawai’i.\n- Interact positively with customers, promoting hotel facilities and services. Resolve problems to the satisfaction of involved parties establishing a culture of empowerment amongst the team.\n- Elevate revenue streams by innovating promotions, private dining experiences, and beverage program offerings.\n- Drive profitability through strategic inventory control, cost-saving initiatives, and dynamic scheduling.\n- Maintain communication with all departments to ensure customer services are met.\n- Develops team spirit and motivation by creating a good working atmosphere.\n- Conducts annual performance appraisals and sets targets for the team.\n- Prepares the training plans in conjunction with the managers under his/her responsibility and follows them up, inspiring and developing a team that takes pride in precision and hospitality.\n- Drives and understands luxury service delivery\n- Helps employees improve their skills and provides support for career development.\n- Live and Breathe Accor Brand and Service Standards.\n- Upon employment, required to fully comply with Fairmont rules and regulations for the safe and effective operation of the hotel’s facilities.\n- Continuously move throughout the restaurant and kitchen areas to Ensure the cleanliness and maintenance of all work areas, utensils, and equipment\n- Ensure that all safety, health, security and loss control policies and procedures and Government legislation are adhered to\n- Follow Food & Beverage policies, procedures and service standards\n- Foster divisional thinking\n\nQualifications\n\n**Your experience and skills include:**\n\n- Experience: 3+ years in food & beverage leadership, preferably in luxury hotels or restaurants.\n- Strong leadership, interpersonal and training skills\n- Ability to focus attention on department needs, remaining calm and courteous at all times\n- Good communication and customer contact skills\n- Excellent reading, writing and oral proficiency in English language\n- Ability to speak other languages and basic understanding of local languages will be an advantage\n- Ability to work well in stressful & high-pressure situations, thriving under pressure with a solutions-oriented mindset.\n- Ability to work cohesively and collaboratively as part of a team\n- Detailed & service oriented with an eye for detail to be self-motivated and energetic.\n- Provide the necessary State and Federal Requirements to work in Food and Beverage (Tuberculosis Clearance)\n- Additional certification(s) in Food & Beverage will be an advantage\n- Passion: A genuine love for hospitality and creating personalized guest experiences.\n\nAdditional Information\n\n**Salary Range:** $78K - $88K USD\n\n**Visa Requirements:** Must be legally eligible to work in the United States. The hotel is unable to assist candidates in obtaining U.S. work authorization.\n\n**Your team and working environment:** Come join the energetic and creative Food & Beverage 'Ohana at the Fairmont Orchid. We work together as a dynamic team to drive guest satisfaction and brand reputation!\n\n**Our commitment to Diversity & Inclusion:**  \nWe are an inclusive company and our ambition is to attract, recruit and promote diverse talent.  \n  \n**Why work for Accor?**\n\nWe are far more than a worldwide leader. We welcome you as you are and you can find a job and brand that matches your personality.\n\nWe support you to grow and learn every day, making sure that work brings purpose to your life, so that during your journey with us, you can continue to explore Accor’s limitless possibilities.\n\nBy joining Accor, every chapter of your story is yours to write and together we can imagine tomorrow's hospitality. Discover the life that awaits you at Accor, visit https://careers.accor.com/\n\n**About Fairmont Hotels & Resorts:** At Fairmont Hotels & Resorts we offer our guests the finest hospitality experience in each of our destinations. And we know that, to offer our guests the best, we first need to offer our employees the best. That’s why you’ll find exceptional work opportunities – throughout North America and the Caribbean, Europe and Africa, the Middle East and Asia Pacific – as well as industry leading training, career development, recognition and rewards. Fairmont Hotels & Resorts is a celebrated collection of hotel that includes landmark locations like London’s The Savoy, New York’s The Plaza, and Shanghai’s Fairmont Peace Hotel. Our teams are guided by values of Respect, Integrity, Teamwork and Empowerment; we employ the highest ethical and quality standards, treating all colleague with fairness & dignity. A community and environmental leader, Fairmont is also regarded for its responsible tourism practices and award – winning Green Partnership Program. An exciting future awaits!\n\nDo what you love, care for the world, dare to challenge the status quo! **#BELIMITLESS**\n\n**#LI-KK2**\n\n**#AlohaOrchid**",
	"salary": "",
	"posted_at": "2025-08-12T20:49:49.658Z",
	"apply_link": "https://careers.accor.com/global/en/job/restaurant-manager-binchotan-bar-and-grille-in-fairmont-orchid-hawaii-kohala-coast-united-states-jid-54149",
	"job_id": "",
	"source": "their_stack",
	"scraped_at": "2025-08-12T20:49:49.658Z",
	"company_website": "group.accor.com",
	"company_domain": "group.accor.com",
	"job_type": "",
	"schedule": "",
	"experience_level": "",
	"job_board_date_added": null,
	"salary_min": null,
	"salary_max": null,
	"salary_period": null,
	"skills": [],
	"job_highlights": {
		"qualifications": [],
		"responsibilities": [],
		"benefits": []
	},
	"apply_links": []
}