{
	"title": "Popeyes Cahaba Park Circle Shift Manager | Now Hiring",
	"company_name": "TICE Chicken Holdings, LLC",
	"location": "Birmingham, AL, US",
	"description": "**Job Title: Popeyes Shift Manager**\n\n **Company:** TICE Chicken Holdings, a franchisee for the Popeyes brand, is currently seeking passionate individuals to join our team in Alabama.\n\n**Job Objective:** Are you ready to join the Popeyes family? We are hiring immediately for the position of Shift Manager. As a Shift Manager, you'll play a crucial role in providing guests with the best experience possible while contributing to the collaborative spirit of our team. This is an opportunity to learn, grow, and explore your career potential within our dynamic organization.\n\n **Essential Duties and Responsibilities:**\n\n\nGreet Guests with a smile, take orders, and process payments efficiently.\n\n\nPrepare and package food and drink products to Popeyes standards.\n\n\nMaintain cleanliness of the restaurant, including dining room, restroom, and exterior.\n\n\nUphold health and safety standards in work areas.\n\n\nDemonstrate knowledge of the Popeyes brand and menu items.\n\n\nEnsure food quality and temperature throughout the day.\n\n\nStrive for maximum efficiency to meet service standards.\n\n\nFill orders accurately and within mandated service time.\n\n\nCollect customer payments and provide accurate change.\n\n\nUnload and stock inventory items as needed.\n\n\nMaintain prompt and regular attendance on assigned shifts.\n\n\nServSafe certification is a plus.\n\n **Qualifications and Skills:**\n\n\nMust be at least eighteen (18\\) years of age.\n\n\nComfortable working in a fast\\-paced environment.\n\n\nAbility to interact positively and professionally with Guests and coworkers.\n\n\nWillingness to learn all areas of restaurant operations and work multiple stations.\n\n\nAvailable to work evenings, weekends, and holidays.\n\n **Physical Demands:**\n\n\nMust be able to lift up to 50 pounds occasionally and up to 15 pounds frequently.\n\n\nAbility to carry products/boxes and miscellaneous items weighing no more than 60 pounds.\n\n\nConsistently handle product preparation.\n\n **Perks:**\n\n\nNo experience necessary, we will train the right candidate.\n\n\nZoom interviews available for convenience.\n\n\nFree Shoes for Crews.\n\n\nFree supplemental health insurance.\n\n **JOIN THE GROWING POPEYES FAMILY!** Don't miss out on this opportunity to be part of a vibrant team and kickstart your career in the food industry. Apply now and become a part of the Popeyes legacy!\n\n  \n\nSimilar Position Titles:  \n\nRestaurant Manager, Fast Food Manager, Shift Manager, Assistant Manager, Management Position, Food Service Manager, Store Manager, Operations Manager, Team Leader, Supervisor, Leadership Role, Restaurant Leadership, Management Opportunity, Front of House Manager, Back of House Manager, Crew Manager, Shift Supervisor, Dining Manager",
	"salary": "",
	"posted_at": "2025-06-25T22:26:58.248Z",
	"apply_link": "",
	"job_id": "in-f0e0389f5c8a1f10",
	"source": "Indeed Direct",
	"scraped_at": "2025-06-25T22:26:41.798Z",
	"company_website": "https://www.wearetice.com/",
	"company_domain": "wearetice.com",
	"job_type": "fulltime",
	"schedule": "",
	"experience_level": "",
	"salary_min": null,
	"salary_max": null,
	"salary_period": null,
	"skills": [],
	"job_highlights": {
		"qualifications": [],
		"responsibilities": [],
		"benefits": []
	},
	"apply_links": []
}