{
	"title": "Deli Manager",
	"company_name": "On the Vine Marketplace",
	"location": "Exeter, NH, US",
	"description": "**Job Summary**  \nWe are seeking an experienced, motivated individual to join our team as the Deli Department Manager. As the manager you are responsible all aspects of the deli department. You will lead a team of individuals to get through tasks for the day, prepare meals and salads along with employees, learn to order as well as put orders away, keep the deli stocked daily, implement merchandising and sales initiatives, ensure superb customer service in every customer interaction and determine departments needs and goals. This position requires considerable prior experience in a food\\-handling environment and experience as a working manager. Our ideal candidate has strong customer service, communication, and organizational skills, and the ability to work well with others to obtain a common goal as a team.\n\nResponsibilities:\n\n* Place orders with vendors based on the department's needs\n* Ensure proper food handling within the department\n* Creating, managing and executing the task list\n* Calculate pricing based on costs and appropriate gross margin\n* Help customers at the meat counter while producing\n* Stocking and refilling depleted inventory following proper rotation procedures\n* Operate various types of equipment including but not limited to: slicers, grill, fryers and range\n* Be able to lift 50 lbs\n* Cleaning and sanitizing backroom prep areas following all Safety and Sanitation Procedures\n* Flexibility to work in other departments\n* Providing excellent customer service\n\nPhysical Demands:\n\n* Regularly required to stand, bend, reach, push, pull, lift, carry, and walk about the store\n* Must be able to perform duties with or without reasonable accommodation\n* Ability to stand for extended periods and lift moderate loads.\n* Flexibility to work weekends, holidays, and variable shifts.\n* Adaptability to a fast\\-paced and dynamic work environment.\n\nJob Qualifications:\n\n* You must be 18 years of age or older to be employed for this role\n* Provides prompt and courteous customer service\n* Ability to operate a cash register efficiently and accurately\n* Ability to perform general cleaning duties to company standards\n* Ability to interpret and apply company policies and procedures\n* Excellent verbal communication skills\n* Ability to work both independently and within a team environment\n* Effective time management\n\nEducation and Experience:\n\n* High School Diploma or equivalent preferred\n* Prior management experience\n* Prior work experience in a deli or kitchen required\n* Ability to handle deli department equipment safely\n* Customer\\-focused with a positive and friendly attitude\n\nJob Type: Full\\-time\n\nPay: Competitive based on experience\n\nBenefits:\n\n* 401(k)\n* 401(k) matching\n* Dental insurance\n* Employee discount\n* Flexible schedule\n* Health insurance\n* Paid time off\n* Paid training\n* Vision insurance\n\nPhysical Setting:\n\n* Grocery store\n\nSchedule:\n\n* 10 hour shift\n* 12 hour shift\n* 8 hour shift\n* Day shift\n* Evening shift\n* Weekends\n\nWork Location: In person\n\nJob Type: Full\\-time\n\nPay: From $52,000\\.00 per year\n\nBenefits:\n\n* 401(k)\n* 401(k) matching\n* Dental insurance\n* Employee discount\n* Flexible schedule\n* Health insurance\n* Paid time off\n* Vision insurance\n\nShift:\n\n* 10 hour shift\n* 12 hour shift\n* 8 hour shift\n* Day shift\n* Evening shift\n\nWork Location: In person",
	"salary": "",
	"posted_at": "2025-06-25T22:27:01.622Z",
	"apply_link": "",
	"job_id": "in-1331c01f2c02f5c1",
	"source": "Indeed Direct",
	"scraped_at": "2025-06-25T22:26:41.799Z",
	"company_website": "https://bayleyvacationrentals.com/recommendation/on-the-vine-marketplace/",
	"company_domain": "bayleyvacationrentals.com",
	"job_type": "fulltime",
	"schedule": "",
	"experience_level": "",
	"salary_min": null,
	"salary_max": null,
	"salary_period": null,
	"skills": [],
	"job_highlights": {
		"qualifications": [],
		"responsibilities": [],
		"benefits": []
	},
	"apply_links": []
}