{
	"title": "Assistant General Manager-(MUST HAVE CASUAL DINING AGM EXPERIENCE) Nashville",
	"company_name": "Hot & Spicy Holdings, LLC",
	"location": "Nashville, TN, US",
	"description": "***PLEASE READ CAREFULLY BEFORE APPLYING FOR THIS POSITION***\n\n***THIS ROLE REQUIRES PREVIOUS RESTAURANT AGM EXPERIENCE, IN A CASUAL DINING ENVIRONMENT. FAST FOOD MANAGERS WILL NOT BE CONSIDERED FOR THIS POSITION. THANK YOU***\n\nAGM\n\nThe AGM position plays a key role in the success of the restaurant. The ideal candidate will be a leader with a proven track record of managing teams and driving sales.\n\nResponsibilities:\n\n· Assisting the GM in overseeing daily operations, including food preparation, service, and cleanliness\n\n· Managing and training team members to ensure excellent customer service and maintain high standards of quality.\n\n· Developing and implementing strategies to increase sales and profitability.\n\n· Monitoring inventory levels and ordering supplies as needed.\n\n· Ensuring compliance with health and safety regulations and company policies\n\n· Handling customer complaints and resolving issues to ensure customer satisfaction.\n\n· Assisting with scheduling and payroll management\n\n· Performing other duties as assigned by the general manager.\n\nThe ideal candidate will have:\n\n· ***A minimum of 3 years of experience in a leadership position in the restaurant industry. Looking for casual dining experience , not fast food .***\n\n· Strong communication, leadership, and problem\\-solving skills.\n\n· A passion for customer service and a commitment to excellence\n\n· Ability to work in a fast\\-paced environment and manage multiple priorities.\n\n· Availability to work flexible hours, including evenings and weekends.\n\nWe offer competitive wages, and a fun and supportive work environment. If you’re ready to join a team that values exceptional service and provides opportunities for growth apply now!\n\nIf you are not familiar with our brand, Gus’s is a full\\-service restaurant serving beer and wine, alongside what is arguably the best fried chicken in the world. Gus’s is the winner of the National Fried Chicken Festival, has been featured on Travel Channel and Food Network, and we have been in numerous articles including Forbes, GQ, Garden \\& Gun, Southern Living, and many, many more.\n\nTo learn more about our amazing brand, visit: https://www.gusfriedchicken.com\n\nThis is a salaried position with a rate based on experience. Benefits available\n\nJob Type: Full\\-time\n\nPay: From $58,000\\.00 per year\n\nBenefits:\n\n* 401(k)\n* 401(k) matching\n* Dental insurance\n* Employee discount\n* Flexible schedule\n* Health insurance\n* Paid time off\n* Vision insurance\n\nSchedule:\n\n* 8 hour shift\n* Day shift\n* Evening shift\n* Monday to Friday\n* Night shift\n* Weekends as needed\n\nApplication Question(s):\n\n* Do you have open availability ?\n* Are you available weekends ?\n\nExperience:\n\n* current AGM: 3 years (Required)\n\nAbility to Commute:\n\n* Nashville, TN 37207 (Required)\n\nWork Location: In person",
	"salary": "",
	"posted_at": "2025-06-25T22:27:11.037Z",
	"apply_link": "",
	"job_id": "in-f99b951c6c4212cd",
	"source": "Indeed Direct",
	"scraped_at": "2025-06-25T22:26:41.799Z",
	"company_website": "https://heatonist.com/?srsltid=AfmBOooiFBk7n-YOvQWeuc3lwoIfGJSamzDU_rSUmepkZOWljlTFOSb6",
	"company_domain": "heatonist.com",
	"job_type": "fulltime",
	"schedule": "",
	"experience_level": "",
	"salary_min": null,
	"salary_max": null,
	"salary_period": null,
	"skills": [],
	"job_highlights": {
		"qualifications": [],
		"responsibilities": [],
		"benefits": []
	},
	"apply_links": []
}